kevinavery/otolith/nrf51822/Source/ble/ble_bondmngr.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include "ble_bondmngr.h"
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf_error.h"
#include "ble_gap.h"
#include "ble_srv_common.h"
#include "app_util.h"
#include "nrf_assert.h"
#include "nrf.h"
#include "nrf51_bitfields.h"
#include "ble_flash.h"
#include "ble_bondmngr_cfg.h"


#define CCCD_SIZE                  6                                                           /**< Number of bytes needed for storing the state of one CCCD. */
#define CRC_SIZE                   2                                                           /**< Size of CRC in sys_attribute data. */
#define SYS_ATTR_BUFFER_MAX_LEN    (((BLE_BONDMNGR_CCCD_COUNT + 1) * CCCD_SIZE) + CRC_SIZE)    /**< Size of sys_attribute data. */
#define MAX_NUM_MASTER_WHITE_LIST  MIN(BLE_BONDMNGR_MAX_BONDED_MASTERS, 8)

#define MAX_BONDS_IN_FLASH  (BLE_FLASH_PAGE_SIZE / (sizeof(master_bond_t) + sizeof(uint32_t))) /**< Maximum number of bonds that can fit into one flash page. */

/**@brief Structure for holding bonding information for one master.
 */
typedef struct
{
    int32_t                        master_handle;                         /**< Master's handle (NOTE: Size is 32 bits just to make struct size dividable by 4). */
    ble_gap_evt_auth_status_t      auth_status;                           /**< Master authentication data. */
    ble_gap_evt_sec_info_request_t master_id_info;                        /**< Master identification info. */
    ble_gap_addr_t                 master_addr;                           /**< Master's address. */
} master_bond_t;

STATIC_ASSERT(sizeof(master_bond_t) % 4 == 0);

/**@brief Structure for holding system attribute information for one master.
 */
typedef struct
{
    int32_t  master_handle;                                               /**< Master's handle (NOTE: Size is 32 bits just to make struct size dividable by 4). */
    uint8_t  sys_attr[SYS_ATTR_BUFFER_MAX_LEN];                           /**< Master sys_attribute data. */
    uint32_t sys_attr_size;                                               /**< Master sys_attribute data's size (NOTE: Size is 32 bits just to make struct size dividable by 4). */
} master_sys_attr_t;

STATIC_ASSERT(sizeof(master_sys_attr_t) % 4 == 0);

/**@brief Structure for holding data for one master.
 */
typedef struct
{
    master_bond_t     bond;                                               /**< Bonding information. */
    master_sys_attr_t sys_attr;                                           /**< System attribute information. */
} master_t;

/**@brief Structure for holding whitelist address data.
 */
typedef struct
{
    int8_t           master_handle;                                       /**< Master's handle. */
    ble_gap_addr_t * p_addr;                                              /**< Pointer to the master's address if BLE_GAP_ADDR_TYPE_PUBLIC. */
} whitelist_addr_t;

/**@brief Structure for holding whitelist IRK data.
 */
typedef struct
{
    int8_t           master_handle;                                       /**< Master's handle. */
    ble_gap_irk_t  * p_irk;                                               /**< Pointer to the master's irk if available. */
} whitelist_irk_t;

static bool                m_is_bondmngr_initialized = false;             /**< Flag for checking if module has been initialized. */
static ble_bondmngr_init_t m_bondmngr_config;                             /**< Configuration as specified by the application. */
static uint16_t            m_conn_handle;                                 /**< Current connection handle. */
static master_t            m_master;                                      /**< Current master data. */
static master_t            m_masters_db[BLE_BONDMNGR_MAX_BONDED_MASTERS]; /**< Pointer to start of bonded masters database. */
static uint8_t             m_masters_in_db_count;                         /**< Number of bonded masters. */
static whitelist_addr_t    m_whitelist_addr[MAX_NUM_MASTER_WHITE_LIST];   /**< List of master's addresses  for the white list. */
static whitelist_irk_t     m_whitelist_irk[MAX_NUM_MASTER_WHITE_LIST];    /**< List of master's irks  for the white list. */
static uint8_t             m_addr_count;                                  /**< Number of addresses in the white list. */
static uint8_t             m_irk_count;                                   /**< Number of irks in the white list. */
static uint16_t            m_crc_bond_info;                               /**< Combined CRC for all bonding information currently stored in flash. */
static uint16_t            m_crc_sys_attr;                                /**< Combined CRC for all system attributes currently stored in flash. */
static uint32_t *          mp_flash_bond_info;                            /**< Pointer to flash location to write next bonding information. */
static uint32_t *          mp_flash_sys_attr;                             /**< Pointer to flash location to write next System Attribute information. */
static uint8_t             m_bond_info_in_flash_count;                    /**< Number of bonding information currently stored in flash. */
static uint8_t             m_sys_attr_in_flash_count;                     /**< Number of System Attributes ccurrently stored in flash. */
 

/**@brief Extract CRC from flash header word.
 *
 * @param[in]  header   Header containing CRC and magic number.
 * @param[out] p_crc    Extracted CRC.
 *
 * @retval      NRF_SUCCESS              CRC successfully extracted.
 * @retval      NRF_ERROR_NOT_FOUND      Flash seems to be empty.
 * @retval      NRF_ERROR_INVALID_DATA   Header does not contain the magic number.
 */
static uint32_t crc_extract(uint32_t header, uint16_t * p_crc)
{
    if ((header & 0xFFFF0000U) == BLE_FLASH_MAGIC_NUMBER)
    {
        *p_crc = (uint16_t)(header & 0x0000FFFFU);
        
        return NRF_SUCCESS;
    }
    else if (header == 0xFFFFFFFFU)
    {
        return NRF_ERROR_NOT_FOUND;
    }
    else
    {
        return NRF_ERROR_INVALID_DATA;
    }
}


/**@brief Store bonding info for specified master to flash.
 *
 * @param[in]  p_bond   Bonding information to be stored.
 *
 * @return     NRF_SUCCESS on success, an error_code otherwise.
 */
static uint32_t bond_info_store(master_bond_t * p_bond)
{
    uint32_t err_code;

    // Check if flash is full
    if (m_bond_info_in_flash_count >= MAX_BONDS_IN_FLASH)
    {
        return NRF_ERROR_NO_MEM;
    }

    // Check if this is the first bond to be stored
    if (m_bond_info_in_flash_count == 0)
    {
        // Initialize CRC
        m_crc_bond_info = ble_flash_crc16_compute(NULL, 0, NULL);
    
