kevinavery/otolith/nrf51822/Source/ble/ble_bondmngr.c
    err_code = ble_flash_page_erase(m_bondmngr_config.flash_page_num_sys_attr);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    return NRF_SUCCESS;
}


/**@brief Check if bonding information in memory is different from the one in flash.
 *
 * @return     TRUE if bonding information has changed, FALSE otherwise.
 */
static bool bond_info_changed(void)
{
    int      i;
    uint16_t crc = ble_flash_crc16_compute(NULL, 0, NULL);
    
    // Compute CRC for all bonds in database
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        crc = ble_flash_crc16_compute((uint8_t *)&m_masters_db[i].bond,
                                      sizeof(master_bond_t),
                                      &crc);
    }
    
    // Compare to CRC of bonds in flash
    return (crc != m_crc_bond_info);
}


/**@brief Check if system attribute information in memory is different from the one in flash.
 *
 * @return     TRUE if system attribute information has changed, FALSE otherwise.
 */
static bool sys_attr_changed(void)
{
    int      i;
    uint16_t crc = ble_flash_crc16_compute(NULL, 0, NULL);
    
    // Compute CRC for all system attributes in database
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        crc = ble_flash_crc16_compute((uint8_t *)&m_masters_db[i].sys_attr,
                                      sizeof(master_sys_attr_t),
                                      &crc);
    }
    
    // Compare to CRC of system attributes in flash with that of the system attributes in memory.
    return (crc != m_crc_sys_attr);
}


/**@brief Set system attributes for specified master, or clear system attributes if master has no
 *        system attributes.
 *
 * @param[in]  p_master   Master for which the system attributes is to be set.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t master_sys_attr_set(master_t * p_master)
{
    uint8_t * p_sys_attr;
    
    if (m_master.sys_attr.sys_attr_size != 0)
    {
        p_sys_attr = m_master.sys_attr.sys_attr;
    }
    else
    {
        p_sys_attr = NULL;
    }
    
    return sd_ble_gatts_sys_attr_set(m_conn_handle, p_sys_attr, m_master.sys_attr.sys_attr_size);
}


/**@brief Update white list data structures.
 */
static void update_white_list(void)
{
    int i;
    
    for (i = 0, m_addr_count = 0, m_irk_count = 0; i < m_masters_in_db_count; i++)
    {
        master_bond_t * p_bond = &m_masters_db[i].bond;
        
        if (p_bond->auth_status.central_kex.irk)
        {
            m_whitelist_irk[m_irk_count].master_handle = p_bond->master_handle;
            m_whitelist_irk[m_irk_count].p_irk         = &(p_bond->auth_status.central_keys.irk);

            m_irk_count++;
        }
        else
        {
            m_whitelist_addr[m_addr_count].master_handle = p_bond->master_handle;
            m_whitelist_addr[m_addr_count].p_addr        = &(p_bond->master_addr);
                
            m_addr_count++;
        }
    }
}


/**@brief Event handler for authentication status message from new master.
 *
 * @details This function adds the new master to database. It also stores the master's bonding
 *          information to flash, and notifies the application that a new bond has been created and
 *          also prepares the stack for connection with this new master by setting the system
 *          attributes.
 *
 * @param[in]  p_auth_status   New authentication status.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t on_auth_status_from_new_master(ble_gap_evt_auth_status_t * p_auth_status)
{
    uint32_t err_code;
    
    if (m_masters_in_db_count >= BLE_BONDMNGR_MAX_BONDED_MASTERS)
    {
        return NRF_ERROR_NO_MEM;
    }

    // Update master
    m_master.bond.auth_status        = *p_auth_status;
    m_master.bond.master_id_info.div = p_auth_status->periph_keys.enc_info.div;
    m_master.sys_attr.sys_attr_size  = 0;

    // Add new master to database
    m_master.bond.master_handle           = m_masters_in_db_count;
    m_masters_db[m_masters_in_db_count++] = m_master;
    
    update_white_list();

    // Clear system attribute info
    err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    // Write new master's bonding information to flash
    err_code = bond_info_store(&m_master.bond);
    if ((err_code == NRF_ERROR_NO_MEM) && (m_bondmngr_config.evt_handler != NULL))
    {
        ble_bondmngr_evt_t evt;
        
        evt.evt_type      = BLE_BONDMNGR_EVT_BOND_FLASH_FULL;
        evt.master_handle = m_master.bond.master_handle;
        
        m_bondmngr_config.evt_handler(&evt);
    }
    else if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    // Pass event to application
    if (m_bondmngr_config.evt_handler != NULL)
    {
        ble_bondmngr_evt_t evt;
        
        evt.evt_type      = BLE_BONDMNGR_EVT_NEW_BOND;
        evt.master_handle = m_master.bond.master_handle;
        
        m_bondmngr_config.evt_handler(&evt);
    }
    
    return NRF_SUCCESS;
}


/**@brief Update the current master's entry in the database.
 */
static uint32_t master_update(void)
{
    uint32_t err_code;
    int32_t  master_handle = m_master.bond.master_handle;
    
    if ((master_handle >= 0) && (master_handle < m_masters_in_db_count))
    {
        m_masters_db[master_handle] = m_master;
        update_white_list();

        err_code = NRF_SUCCESS;
    }
    else
    {
        err_code = NRF_ERROR_INVALID_PARAM;
    }

    return err_code;
}


/**@brief Find master corresponding to the specified diversificator.
 *
 * @param[in]  master_div   Diversificator to search for.
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t master_find_in_db(uint16_t master_div)
{
    int i;
    
    m_master.bond.master_handle = INVALID_MASTER_HANDLE;
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        if (master_div == m_masters_db[i].bond.master_id_info.div)
        {
            m_master = m_masters_db[i];
            return NRF_SUCCESS;
        }
    }
    
    return NRF_ERROR_NOT_FOUND;
}


/**@brief Load bonding information and system attribute information from flash.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t load_all_from_flash(void)
{
    uint32_t err_code;
    int      i;
    
    // Load bond information for all masters
    m_masters_in_db_count = 0;

    while (m_masters_in_db_count < BLE_BONDMNGR_MAX_BONDED_MASTERS)
    {
        master_bond_t master_bond_info;
        int           master_handle;
        
        // Load bonding information
        err_code = bonding_info_load_from_flash(&master_bond_info);
        if (err_code == NRF_ERROR_NOT_FOUND)
        {
            // No more bonds in flash
            break;
        }
        else if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        master_handle = master_bond_info.master_handle;
        if (master_handle > m_masters_in_db_count)
        {
            // Master handle value(s) missing in flash. This should never happen.
            return NRF_ERROR_INVALID_DATA;
        }
        else
        {
            // Add/update bonding information in master array
            m_masters_db[master_handle].bond = master_bond_info;
            if (master_handle == m_masters_in_db_count)
            {
                // New master handle, clear system attribute information
                m_masters_db[master_handle].sys_attr.sys_attr_size = 0;
                m_masters_db[master_handle].sys_attr.master_handle = INVALID_MASTER_HANDLE;
                m_masters_in_db_count++;
            }
            else
            {
                // Entry was updated, do nothing
            }
        }
    }

