kevinavery/otolith/nrf51822/Source/ble/ble_bondmngr.c
    // Load system attribute information for all previously known masters.
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        master_sys_attr_t master_sys_attr;
        
        // Load system attribute information
        err_code = sys_attr_load_from_flash(&master_sys_attr);
        if (err_code == NRF_ERROR_NOT_FOUND)
        {
            // No more system attributes in flash
            break;
        }
        else if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        if (master_sys_attr.master_handle > m_masters_in_db_count)
        {
            // Master handle value(s) missing in flash. This should never happen.
            return NRF_ERROR_INVALID_DATA;
        }
        else
        {
            // Add/update bonding information in master array
            m_masters_db[master_sys_attr.master_handle].sys_attr = master_sys_attr;
        }
    }
    
    // Initialize the remaining empty bond entries in the memory.
    for (i = m_masters_in_db_count; i < BLE_BONDMNGR_MAX_BONDED_MASTERS; i++)
    {
        m_masters_db[i].bond.master_handle     = INVALID_MASTER_HANDLE;
        m_masters_db[i].sys_attr.sys_attr_size = 0;
        m_masters_db[i].sys_attr.master_handle = INVALID_MASTER_HANDLE;
    }
    
    // Update write list data structures
    update_white_list();
    
    return NRF_SUCCESS;
}


/**@brief Check if two ble_gap_sec_levels_t variables are equal.
 *
 * @param[in]  p_sec_levels_1   Variable 1.
 * @param[in]  p_sec_levels_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool sec_levels_equal(ble_gap_sec_levels_t * p_sec_levels_1,
                             ble_gap_sec_levels_t * p_sec_levels_2)
{
    return ((p_sec_levels_1->lv1 == p_sec_levels_2->lv1) &&
            (p_sec_levels_1->lv2 == p_sec_levels_2->lv2) &&
            (p_sec_levels_1->lv3 == p_sec_levels_2->lv3));
}


/**@brief Check if two ble_gap_sec_keys_t variables are equal.
 *
 * @param[in]  p_sec_keys_1   Variable 1.
 * @param[in]  p_sec_keys_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool sec_keys_equal(ble_gap_sec_keys_t * p_sec_keys_1,
                           ble_gap_sec_keys_t * p_sec_keys_2)
{
    return ((p_sec_keys_1->ltk       == p_sec_keys_2->ltk)       &&
            (p_sec_keys_1->ediv_rand == p_sec_keys_2->ediv_rand) &&
            (p_sec_keys_1->irk       == p_sec_keys_2->irk)       &&
            (p_sec_keys_1->address   == p_sec_keys_2->address)   &&
            (p_sec_keys_1->csrk      == p_sec_keys_2->csrk));
}


/**@brief Check if two ble_gap_enc_info_t variables are equal.
 *
 * @param[in]  p_enc_info_1   Variable 1.
 * @param[in]  p_enc_info_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool enc_info_equal(ble_gap_enc_info_t * p_enc_info_1,
                           ble_gap_enc_info_t * p_enc_info_2)
{
    return ((p_enc_info_1->div     == p_enc_info_2->div)     &&
            (p_enc_info_1->auth    == p_enc_info_2->auth)    &&
            (p_enc_info_1->ltk_len == p_enc_info_2->ltk_len) &&
            (memcmp(p_enc_info_1->ltk, p_enc_info_2->ltk, p_enc_info_1->ltk_len) == 0));
}


/**@brief Check if two ble_gap_irk_t variables are equal.
 *
 * @param[in]  p_irk_1   Variable 1.
 * @param[in]  p_irk_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool irk_equal(ble_gap_irk_t * p_irk_1,
                      ble_gap_irk_t * p_irk_2)
{
    return (memcmp(p_irk_1->irk, p_irk_2->irk, BLE_GAP_SEC_KEY_LEN) == 0);
}


/**@brief Check if two ble_gap_addr_t variables are equal.
 *
 * @param[in]  p_addr_1   Variable 1.
 * @param[in]  p_addr_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool addr_equal(ble_gap_addr_t * p_addr_1,
                       ble_gap_addr_t * p_addr_2)
{
    return ((p_addr_1->addr_type == p_addr_2->addr_type) &&
            (memcmp(p_addr_1->addr, p_addr_2->addr, BLE_GAP_ADDR_LEN) == 0));
}


/**@brief Check if two ble_gap_evt_auth_status_t variables are equal.
 *
 * @param[in]  p_auth_status_1   Variable 1.
 * @param[in]  p_auth_status_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool auth_status_equal(ble_gap_evt_auth_status_t * p_auth_status_1,
                              ble_gap_evt_auth_status_t * p_auth_status_2)
{
    return ((p_auth_status_1->auth_status == p_auth_status_2->auth_status)                    &&
            (p_auth_status_1->error_src   == p_auth_status_2->error_src)                      &&
            sec_levels_equal(&p_auth_status_1->sm1_levels, &p_auth_status_2->sm1_levels)      &&
            sec_levels_equal(&p_auth_status_1->sm2_levels, &p_auth_status_2->sm2_levels)      &&
            sec_keys_equal(&p_auth_status_1->periph_kex, &p_auth_status_2->periph_kex)        &&
            sec_keys_equal(&p_auth_status_1->central_kex, &p_auth_status_2->central_kex)      &&
            enc_info_equal(&p_auth_status_1->periph_keys.enc_info,
                           &p_auth_status_2->periph_keys.enc_info)                            &&
            irk_equal(&p_auth_status_1->central_keys.irk, &p_auth_status_2->central_keys.irk) &&
            addr_equal(&p_auth_status_1->central_keys.id_info,
                       &p_auth_status_2->central_keys.id_info));
}


/**@brief Connect event handler.
 *
 * @param[in]  p_ble_evt   Event received from the BLE stack.
 */
static void on_connect(ble_evt_t * p_ble_evt)
{
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    
    m_master.bond.master_handle     = INVALID_MASTER_HANDLE;
    m_master.bond.master_addr       = p_ble_evt->evt.gap_evt.params.connected.peer_addr;
    m_master.sys_attr.sys_attr_size = 0;

